app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "icjon"]]
---
  def create
    user = User.find_by_user_id(params[:user][:user_id])