app/controllers/users_controller.rb

  def create
    if User.find_by_user_id(params[:user][:user_id])
      flash[:notice]= "Sorry, this user-id is taken.  Try again."
      redirect_to new_user_path
    else
      @user = User.create_user!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "foo"]]
INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "foo"], ["email", "foo@gmail.com"], ["session_token", "XhJQrIhUaEES4kDjTABwzg=="], ["created_at", "2015-09-30 20:36:56.200420"], ["updated_at", "2015-09-30 20:36:56.200420"]]